package main

import (
	"fmt"
	"runtime"
	"time"
)

//#[AT,DF,MP,MV,A修正,D修正,M修正,INT知力,DEX判断,MR指挥范围,SOC兵数,"文字说明"]
//#  :at,:df,:mp,:mv,:ax,:dx,:mx,:int,:dex,:mr,:soc,:txt
type myarr struct {
	at   int //这里可以使用at,df,mp,mv,ax,dx,mx,intt,dex,mr,soc int这样的写法
	df   int
	mp   int
	mv   int
	ax   int
	dx   int
	mx   int
	intt int
	dex  int
	mr   int
	soc  int
	txt  string
}

func apa(a myarr, b myarr) (ret myarr) {
	var re myarr //re := myarr{}
	re.at = a.at + b.at
	re.df = a.df + b.df
	re.mp = a.mp + b.mp
	re.mv = a.mv + b.mv
	re.ax = a.ax + b.ax
	re.dx = a.dx + b.dx
	re.mx = a.mx + b.mx
	re.intt = a.intt + b.intt
	re.dex = a.dex + b.dex
	re.mr = a.mr + b.mr
	re.soc = a.soc + b.soc
	re.txt = a.txt + b.txt
	return re
}
func main() {
	start := time.Now()
	an3 := []myarr{
		{0, 2, 0, 0, 0, 2, 0, 0, 0, 0, -1, " 3摩羯地 "},
		{1, 0, 0, 0, 0, 0, 0, 6, 0, 0, -1, " 3水瓶风 "},
		{0, -1, 2, 0, 2, -1, 0, 2, 0, 0, 0, " 3双鱼水 "},
		{1, -1, 0, 0, 0, 0, 0, 0, 3, 0, 0, " 3白羊火 "},
		{0, 0, 0, 0, 0, 1, 0, -4, 0, 0, 0, " 3金牛风 "},
		{0, 0, 4, 0, 0, 0, 0, 7, 0, 0, 0, " 3双子火 "},
		{0, -1, 0, 0, 0, 0, 4, 0, 0, 0, 1, " 3巨蟹水 "},
		{1, 1, 0, 0, 1, 0, 0, -3, 0, 0, 0, " 3狮子火 "},
		{0, 0, 0, 0, -1, 1, 0, 0, 0, 0, 0, " 3处女地 "},
		{0, 0, 0, 0, 0, 0, 3, -4, 0, 0, 1, " 3天枰风 "},
		{2, 2, 0, 0, 0, -1, 0, 4, 0, 0, 0, " 3天蝎水 "},
		{1, 1, 0, 2, 0, 0, 0, 0, 0, 0, 0, " 3人马火 "}}

	an4 := []myarr{
		{0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, " 4缟玛瑙 (魔法:ホ－リ－ブレイズ) "},
		{0, 0, 0, 0, 0, 0, 0, 3, 0, 0, 0, " 4紫水晶 "},
		{0, 0, 0, 0, 0, 0, -8, 0, 0, 0, 0, " 4红宝石 (特技:リジェネレ－ト) "},
		{0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, " 4绿宝石 "},
		{-2, -2, 0, 0, 0, 0, 0, 0, 0, 0, 0, " 4黄宝石 (特技:リジェネレ－ト)"},
		{0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, " 4海蓝石 "},
		{1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, " 4黑宝石 (特技:判断上升)"},
		{0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, " 4杉石8 (魔法:瞬移) "},
		{0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, " 4石榴石 (随机:df+1) "},
		{0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, " 4孔雀石 (魔法:解毒) "},
		{0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, " 4玛瑙11 (特技:クリテカル) "},
		{0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, " 4蓝宝石 (后期:佣兵天使) "}}

	an5 := []myarr{
		{0, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, " 5选1 6a"},
		{0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, " 5选2 (消耗+) 6b"},
		{1, 0, 3, 0, 0, 0, 0, 2, 0, 0, 0, " 5选3 6c"},
		{2, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, " 5选4 6d"}}

	an6a := []myarr{
		{0, 0, 0, 0, 1, 0, 0, 6, 0, 0, 0, "选1主动 7b"},
		{0, 0, 0, 0, 0, 1, 0, 4, 0, 0, 0, "选2受动 7a"},
		{0, 0, 5, 0, 0, 0, 0, 3, 0, 0, 0, "选3怀疑(魔法:mp吸收) 7c"},
		{0, 0, 4, 0, 0, 0, 0, 2, 0, 0, 0, "选4无反应(魔法:减速,束缚) 7d"}}

	an7a := []myarr{
		{0, 0, 0, 0, 0, 0, 3, 0, 0, 0, 0, "选1光 8a"},
		{1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, "选2混沌 8d"},
		{0, 0, 0, 0, 1, 1, 0, 0, 0, 0, 0, "选3神 8c"},
		{0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, "选4意志 8d"}}

	an8a := []myarr{
		{0, 0, 0, 0, 0, 0, 0, 1, 0, 0, 1, "选1支配(出入?技能:剑装备) 9a"},
		{0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, "选2神 9d"},
		{0, 1, 0, 0, 0, 0, 0, 4, 0, 0, 0, "选3和平 9b"},
		{0, 0, 0, 0, 0, 0, 2, 0, 0, 0, 0, "选4幸福 9c"}}

	an9a := []myarr{
		{0, 0, 0, 0, 1, 1, 1, 0, 0, 0, -1, "少数精锐 10"},
		{0, 0, 0, 0, -1, -1, -2, 0, 0, 0, 2, "个人大部队 10"},
		{2, 2, 0, 0, -1, -1, -2, 0, 0, 0, 0, "自身强 10"},
		{0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, "忠实部队(消耗+2 mv修+2) 10"}}

	an9c := []myarr{
		{2, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, "选1武力 10"},
		{0, 0, 5, 0, 0, 0, 0, 5, 0, 0, 0, "选2知力 10"},
		{0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, "统帅力(消耗增加) 10"},
		{0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, "选4魅力 10"}}

	an11 := []myarr{
		{0, 2, 0, 0, 0, 1, 0, 4, 0, 0, 0, "神学(魔法:回复1 魔法盾)"},
		{0, 0, 4, 0, 1, 0, 0, 4, 0, 0, 0, "魔术(魔法:火弹 冰结)"},
		{2, 1, 0, 0, 0, 1, 2, 0, 0, 0, 0, "防御(魔法:防御1)"},
		{3, 0, 0, 0, 2, 0, 0, 0, 0, 0, 0, "攻击(魔法:攻击1)"}}

	////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////

	arytemp := myarr{}
	arytotal := []myarr{}

	count := 0
	for an3i := 0; an3i < 12; an3i++ {
		for an4i := 0; an4i < 12; an4i++ {
			for an5i := 0; an5i < 4; an5i++ {
				an6 := an6a
				for an6i := 0; an6i < 4; an6i++ {
					an7 := an7a
					for an7i := 0; an7i < 4; an7i++ {
						an8 := an8a
						for an8i := 0; an8i < 4; an8i++ {
							an9 := an9a
							for an9i := 0; an9i < 4; an9i++ {
								an10 := an9c
								for an10i := 0; an10i < 4; an10i++ {
									for an11i := 0; an11i < 4; an11i++ {

										arytemp = apa(an3[an3i], an4[an4i])
										arytemp = apa(arytemp, an5[an5i])
										arytemp = apa(arytemp, an6[an6i])
										arytemp = apa(arytemp, an7[an7i])
										arytemp = apa(arytemp, an8[an8i])
										arytemp = apa(arytemp, an9[an9i])
										arytemp = apa(arytemp, an10[an10i])
										arytemp = apa(arytemp, an11[an11i])
										//if count <1200000 {
										//我想说这里,count只要超过大概120万就会导致出错,限制在大概120万内则能顺利赋值给arytotal,为什么呢
										arytotal = append(arytotal, arytemp)

										//}

										count = count + 1

									} //an11i

								} //an10i

							} //an9i

						} //an8i

					} //an7i

				} //an6i

			} //an5i

		} //an4i
		runtime.GC() //在这里,加个内存清理
	} //end for an3i
	fmt.Println("count=", count+1) //count=2359297 Done in 7078~8781
	fmt.Println(arytotal[1190000])
	end := time.Since(start)
	fmt.Println("Done in", end.Nanoseconds()/1000000.0)

}
